import styled from "styled-components";

const Wrapper = styled.div`
  width: 90%;
  height: 100%;
  background-color: #F9F9F9;
  border-radius: 8px;
  box-shadow: 5px 5px 2px 1px #E2E0E0;
`;


const Containerr = styled.div`
  padding: 30px;
  display: flex;
  flex-wrap: wrap;
  justify-content: space-between;
`;



const Container = styled.div`
  flex: 1;
  margin: 5px;
  min-width: 150px;
  height: 200px;
  display: flex;
  
`;




const Info = styled.div`
display: flex;
justify-content: center;
flex-direction:column ;
align-items:center ;
margin-top: 19% ;
font-size:16px ;
`;


const Text = styled.h1`
align-items:center ;
text-align:center ;
font-size:16px ;
font-weight:normal ;
`;

const F = () => {
  return (
      <Containerr>
    <Container>
      <Wrapper>

       
        <Info>
       
        <svg xmlns="http://www.w3.org/2000/svg" width="33.154" height="37.543" viewBox="0 0 33.154 37.543">
  <g id="Groupe_1009" data-name="Groupe 1009" transform="translate(-3257 -438)">
    <path id="Tracé_2096" data-name="Tracé 2096" d="M90.233,434.839l-.308.534,1.817-.244-.192-.467Z" transform="translate(3171.475 35.21)" fill="#2b8bf9"/>
    <path id="Tracé_2100" data-name="Tracé 2100" d="M282.388,230.21l-.225-1.312-1.135.6Z" transform="translate(2994.384 225.886)" fill="#2b8bf9"/>
    <path id="Tracé_2101" data-name="Tracé 2101" d="M187.28,106.988a.733.733,0,0,0-.592-.5l-3.19-.463-1.427-2.89a.733.733,0,0,0-.657-.409h0a.733.733,0,0,0-.657.409l-1.426,2.891-3.19.464a.733.733,0,0,0-.406,1.251l2.309,2.249-.544,3.177a.733.733,0,0,0,1.064.773l2.853-1.5,2.853,1.5a.733.733,0,0,0,1.064-.773l-.546-3.177,2.308-2.25A.734.734,0,0,0,187.28,106.988Zm-3.793,2.222a.733.733,0,0,0-.211.649l.359,2.092-1.879-.987a.733.733,0,0,0-.682,0l-1.879.988.358-2.093a.733.733,0,0,0-.211-.649l-1.521-1.482,2.1-.306a.733.733,0,0,0,.552-.4l.939-1.9.94,1.9a.733.733,0,0,0,.552.4l2.1.3Z" transform="translate(3092.163 342.805)" fill="#2b8bf9"/>
    <path id="Tracé_2102" data-name="Tracé 2102" d="M62.984,32.217,56.923,21.675a13.346,13.346,0,1,0-20.837,0L30.025,32.217a.733.733,0,0,0,.733,1.092l4.731-.635L37.3,37.089a.733.733,0,0,0,.629.453l.049,0a.733.733,0,0,0,.635-.367l6.119-10.6,0,0a13.38,13.38,0,0,0,3.533,0l0,0,6.119,10.6a.733.733,0,0,0,.635.367l.049,0a.733.733,0,0,0,.629-.453l1.815-4.414,4.731.635a.733.733,0,0,0,.733-1.092ZM38.093,35.151l-1.321-3.213L37.957,30a.733.733,0,1,0-1.25-.766l-1.2,1.955-3.471.466,5.08-8.836a13.345,13.345,0,0,0,6.1,3.458ZM34.626,13.346A11.879,11.879,0,1,1,46.5,25.224,11.892,11.892,0,0,1,34.626,13.346ZM57.5,31.192l-1.2-1.955a.733.733,0,0,0-1.25.766l1.186,1.935-1.321,3.213L49.794,26.28a13.345,13.345,0,0,0,6.1-3.458l5.08,8.836Z" transform="translate(3227.073 438)" fill="#2b8bf9"/>
    <path id="Tracé_2103" data-name="Tracé 2103" d="M200.877,65.635a9.448,9.448,0,0,0,.926-4.1,9.535,9.535,0,0,0-14.2-8.313.733.733,0,1,0,.719,1.278A8.069,8.069,0,0,1,199.553,65a.733.733,0,1,0,1.323.632Z" transform="translate(3081.307 389.813)" fill="#2b8bf9"/>
    <path id="Tracé_2104" data-name="Tracé 2104" d="M332.068,255.821l-.016.017a.733.733,0,1,0,1.049,1.025l.019-.02a.733.733,0,1,0-1.052-1.021Z" transform="translate(2947.295 201.144)" fill="#2b8bf9"/>
    <path id="Tracé_2105" data-name="Tracé 2105" d="M139.415,133.753a8.07,8.07,0,0,1-11.231-10.409.733.733,0,0,0-1.335-.608,9.536,9.536,0,0,0,13.274,12.3.733.733,0,1,0-.708-1.284Z" transform="translate(3138.048 324.662)" fill="#2b8bf9"/>
    <path id="Tracé_2106" data-name="Tracé 2106" d="M158.717,91.7a.731.731,0,0,0,.538-.235l.013-.014a.733.733,0,0,0-1.073-1l-.016.018a.733.733,0,0,0,.538,1.231Z" transform="translate(3108.406 354.399)" fill="#2b8bf9"/>
  </g>
</svg>

      <Text>
          Produits de qualité & Meilleur prix
      </Text>
 
        </Info>
      </Wrapper>
    </Container>


       <Container>

       <Wrapper>
         <Info>
         <svg id="Composant_18_2" data-name="Composant 18 – 2" xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48">
  <rect id="Rectangle_1840" data-name="Rectangle 1840" width="48" height="48" fill="none"/>
  <g id="exchange" transform="translate(5 4.499)">
    <path id="Tracé_2107" data-name="Tracé 2107" d="M36.712,8.522,22.268.59a.725.725,0,0,0-.7,0L16.126,3.58a.726.726,0,0,0-.311.171L7.127,8.522a.724.724,0,0,0-.376.635V18.75A9.65,9.65,0,0,0,.978,32.181a.724.724,0,0,0,1.3-.636,8.189,8.189,0,1,1,3.764,3.764.724.724,0,0,0-.636,1.3,9.656,9.656,0,0,0,13.041-4.739l3.121,1.714a.724.724,0,0,0,.7,0l14.444-7.931a.725.725,0,0,0,.376-.635V19.985a.724.724,0,1,0-1.449,0v4.605L22.646,31.726V17.516l4.288-2.355v3.733a.724.724,0,0,0,1.074.635l3.1-1.7a.724.724,0,0,0,.375-.634V12.666l4.161-2.285v3.81a.724.724,0,1,0,1.449,0V9.157A.724.724,0,0,0,36.712,8.522ZM21.919,2.051,34.859,9.157,30.777,11.4,17.838,4.293Zm0,14.21L8.98,9.157l4.231-2.324,12.94,7.1Zm5.736-3.15-12.939-7.1,1.616-.888,12.94,7.1Zm-11.2,8.021A9.575,9.575,0,0,0,9.64,18.31a9.77,9.77,0,0,0-1.441.106V10.381l13,7.137v14.21l-2.256-1.239a9.685,9.685,0,0,0,.337-2.541A9.575,9.575,0,0,0,16.456,21.133Zm13.574-4.371-1.647.906v-3.3l1.647-.9Zm0,0" transform="translate(0)" fill="#2b8bf9"/>
    <path id="Tracé_2108" data-name="Tracé 2108" d="M492.724,219.441a.725.725,0,1,0,.512.212A.73.73,0,0,0,492.724,219.441Zm0,0" transform="translate(-456.361 -203.081)" fill="#2b8bf9"/>
    <path id="Tracé_2109" data-name="Tracé 2109" d="M67.923,326.346a.724.724,0,0,0,.512-1.237l-.5-.5h4.281a1.883,1.883,0,1,1,0,3.767H69.677a.724.724,0,1,0,0,1.448h2.537a3.332,3.332,0,1,0,0-6.664H67.933l.5-.5a.724.724,0,0,0-1.024-1.025l-1.738,1.738a.725.725,0,0,0,0,1.025l1.738,1.738A.722.722,0,0,0,67.923,326.346Zm0,0" transform="translate(-60.718 -297.674)" fill="#2b8bf9"/>
    <path id="Tracé_2110" data-name="Tracé 2110" d="M36.793,457.882a.721.721,0,0,1-.553-.258v0a.723.723,0,1,1,.555.259Zm0,0" transform="translate(-33.455 -422.905)" fill="#2b8bf9"/>
  </g>
</svg>

<Text>
         Rapidité d’impression et de livraison 
         </Text>
 </Info>
       </Wrapper>
     </Container>

<Container>
  <Wrapper>
  <Info>
  <svg id="Composant_19_2" data-name="Composant 19 – 2" xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48">
  <rect id="Rectangle_1841" data-name="Rectangle 1841" width="48" height="48" fill="none"/>
  <g id="setting" transform="translate(4 -2)">
    <path id="Tracé_2111" data-name="Tracé 2111" d="M37.394,35.2h-.6V15a3,3,0,0,0-3-3H6.2a3,3,0,0,0-3,3V35.2H2.6a.6.6,0,0,0-.6.6v2.4a3,3,0,0,0,3,3H34.994a3,3,0,0,0,3-3V35.8A.6.6,0,0,0,37.394,35.2ZM4.4,15a1.8,1.8,0,0,1,1.8-1.8h27.6a1.8,1.8,0,0,1,1.8,1.8V35.2H4.4ZM17,36.4h6V37a.6.6,0,0,1-.6.6H17.6A.6.6,0,0,1,17,37Zm19.8,1.8a1.8,1.8,0,0,1-1.8,1.8H5a1.8,1.8,0,0,1-1.8-1.8V36.4H15.8V37a1.8,1.8,0,0,0,1.8,1.8h4.8A1.8,1.8,0,0,0,24.2,37v-.6h12.6Z" fill="#2b8bf9"/>
    <path id="Tracé_2112" data-name="Tracé 2112" d="M16,21h1.2v1.2H16Z" transform="translate(-5.601 -4.401)" fill="#2b8bf9"/>
    <path id="Tracé_2113" data-name="Tracé 2113" d="M20,21h1.2v1.2H20Z" transform="translate(-7.202 -4.401)" fill="#2b8bf9"/>
    <path id="Tracé_2114" data-name="Tracé 2114" d="M24,21h1.2v1.2H24Z" transform="translate(-8.802 -4.401)" fill="#2b8bf9"/>
    <path id="Tracé_2115" data-name="Tracé 2115" d="M17.387,32.635l-1.352-1.352.849-.849,1.352,1.352a.6.6,0,0,0,.767.068,5.809,5.809,0,0,1,2.3-.96.6.6,0,0,0,.493-.588V28.4H23v1.908a.6.6,0,0,0,.493.59,5.809,5.809,0,0,1,2.3.96.6.6,0,0,0,.767-.068l1.352-1.35.849.849-1.351,1.352a.6.6,0,0,0-.068.767,5.819,5.819,0,0,1,.96,2.3.6.6,0,0,0,.588.49H30.8v1.2H27.154a4.8,4.8,0,1,0-9.512,0H14V36.2h1.908a.6.6,0,0,0,.59-.493,5.81,5.81,0,0,1,.96-2.3.6.6,0,0,0-.07-.767ZM18.8,36.8a3.6,3.6,0,1,1,7.145.6H18.852a3.675,3.675,0,0,1-.054-.6ZM33.2,23H11.6V20.6H33.2Zm1.2,14.4v-18h-24v18ZM11.6,24.2H33.2V37.4H32V35.6a.6.6,0,0,0-.6-.6H29.371a6.953,6.953,0,0,0-.773-1.855l1.434-1.434a.6.6,0,0,0,0-.848l-1.7-1.7a.6.6,0,0,0-.848,0l-1.433,1.433a6.975,6.975,0,0,0-1.856-.772V27.8a.6.6,0,0,0-.6-.6H21.2a.6.6,0,0,0-.6.6v2.025a6.952,6.952,0,0,0-1.855.772l-1.434-1.433a.6.6,0,0,0-.848,0l-1.7,1.7a.6.6,0,0,0,0,.848L16.2,33.141A6.952,6.952,0,0,0,15.424,35H13.4a.6.6,0,0,0-.6.6v1.8H11.6Z" transform="translate(-2.401 -1.6)" fill="#2b8bf9"/>
    <path id="Tracé_2116" data-name="Tracé 2116" d="M18,32h1.2v1.2H18Z" transform="translate(-6.402 -8.802)" fill="#2b8bf9"/>
    <path id="Tracé_2117" data-name="Tracé 2117" d="M18,28h1.2v1.2H18Z" transform="translate(-6.402 -7.202)" fill="#2b8bf9"/>
    <path id="Tracé_2118" data-name="Tracé 2118" d="M16,30h1.2v1.2H16Z" transform="translate(-5.601 -8.002)" fill="#2b8bf9"/>
    <path id="Tracé_2119" data-name="Tracé 2119" d="M20,30h1.2v1.2H20Z" transform="translate(-7.202 -8.002)" fill="#2b8bf9"/>
    <path id="Tracé_2120" data-name="Tracé 2120" d="M44,32h1.2v1.2H44Z" transform="translate(-16.804 -8.802)" fill="#2b8bf9"/>
    <path id="Tracé_2121" data-name="Tracé 2121" d="M44,28h1.2v1.2H44Z" transform="translate(-16.804 -7.202)" fill="#2b8bf9"/>
    <path id="Tracé_2122" data-name="Tracé 2122" d="M46,30h1.2v1.2H46Z" transform="translate(-17.605 -8.002)" fill="#2b8bf9"/>
    <path id="Tracé_2123" data-name="Tracé 2123" d="M42,30h1.2v1.2H42Z" transform="translate(-16.004 -8.002)" fill="#2b8bf9"/>
  </g>
</svg>
<Text>
      Votre propre design 
      </Text>
      </Info>
  </Wrapper>
</Container>

<Container>
<Wrapper>
<Info>
<svg id="Composant_20_2" data-name="Composant 20 – 2" xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48">
  <rect id="Rectangle_1842" data-name="Rectangle 1842" width="48" height="48" fill="none"/>
  <g id="Groupe_1010" data-name="Groupe 1010" transform="translate(-3649 -421)">
    <g id="Groupe_986" data-name="Groupe 986" transform="translate(3668.442 437.93)">
      <g id="Groupe_985" data-name="Groupe 985" transform="translate(0 0)">
        <path id="Tracé_2124" data-name="Tracé 2124" d="M185.884,152A1.886,1.886,0,0,0,184,153.884h1.256a.628.628,0,0,1,1.256,0h1.256A1.886,1.886,0,0,0,185.884,152Z" transform="translate(-184 -152)" fill="#2b8bf9"/>
      </g>
    </g>
    <g id="Groupe_988" data-name="Groupe 988" transform="translate(3673.465 437.93)">
      <g id="Groupe_987" data-name="Groupe 987" transform="translate(0 0)">
        <path id="Tracé_2125" data-name="Tracé 2125" d="M249.884,152A1.886,1.886,0,0,0,248,153.884h1.256a.628.628,0,0,1,1.256,0h1.256A1.886,1.886,0,0,0,249.884,152Z" transform="translate(-248 -152)" fill="#2b8bf9"/>
      </g>
    </g>
    <g id="Groupe_990" data-name="Groupe 990" transform="translate(3670.325 454.883)">
      <g id="Groupe_989" data-name="Groupe 989" transform="translate(0)">
        <path id="Tracé_2126" data-name="Tracé 2126" d="M210.512,368a2.512,2.512,0,1,0,2.512,2.512A2.514,2.514,0,0,0,210.512,368Zm0,3.767a1.256,1.256,0,1,1,1.256-1.256A1.257,1.257,0,0,1,210.512,371.767Z" transform="translate(-208 -368)" fill="#2b8bf9"/>
      </g>
    </g>
    <g id="Groupe_992" data-name="Groupe 992" transform="translate(3654 426)">
      <g id="Groupe_991" data-name="Groupe 991">
        <path id="Tracé_2127" data-name="Tracé 2127" d="M33.906,36.418V28.255a9.429,9.429,0,0,0-9.418-9.418H23.8a7.56,7.56,0,0,0,.633-.628h.679a3.143,3.143,0,0,0,3.139-3.139V13.963a2.821,2.821,0,0,0-.008-4.7,9.412,9.412,0,0,0-18.822,0,2.824,2.824,0,0,0,1.562,5.177h.428a7.522,7.522,0,0,0,2.454,4.4h-.684a9.429,9.429,0,0,0-9.418,9.418v8.163H0v1.256H37.674V36.418ZM27,15.07a1.88,1.88,0,0,1-1.632,1.858,7.467,7.467,0,0,0,.89-2.486h.428A2.726,2.726,0,0,0,27,14.41Zm1.256-3.453a1.572,1.572,0,0,1-1.57,1.57h-.314V10.046h.314A1.572,1.572,0,0,1,28.255,11.616ZM11.3,13.186h-.314a1.57,1.57,0,1,1,0-3.139H11.3Zm-.314-4.4a2.649,2.649,0,0,0-.284.029,8.154,8.154,0,0,1,16.265,0,2.649,2.649,0,0,0-.284-.029h-.428a7.525,7.525,0,0,0-14.842,0Zm14.127,1.24c-4.532-.159-7.534-2.012-7.534-3.752a.628.628,0,0,0-1.256,0c0,1.569-1.622,2.869-3.731,3.1a6.278,6.278,0,0,1,12.521.652ZM12.558,13.186V10.639A5.8,5.8,0,0,0,17.014,8.2c1.314,1.741,4.383,2.966,8.1,3.091v1.9a6.24,6.24,0,0,1-1.268,3.767H18.837v1.256h3.751a6.275,6.275,0,0,1-10.03-5.023ZM16.9,20.458a7.307,7.307,0,0,0,3.882,0L18.837,24.34Zm.925,4.658H16.713L14.2,20.093h1.108Zm4.543-5.023h1.108L20.96,25.116H19.853ZM6.907,28.255v8.163H5.023V28.255a8.165,8.165,0,0,1,7.784-8.143l2.5,5H10.046A3.143,3.143,0,0,0,6.907,28.255Zm22.6,8.163H8.163V28.255a1.886,1.886,0,0,1,1.884-1.884H27.627a1.886,1.886,0,0,1,1.884,1.884Zm3.139,0H30.767V28.255a3.143,3.143,0,0,0-3.139-3.139H22.364l2.5-5a8.165,8.165,0,0,1,7.784,8.143Z" fill="#2b8bf9"/>
      </g>
    </g>
  </g>
</svg>
<Text>
Travail d’une journée complète de la semaine 
</Text>
</Info>
</Wrapper>
</Container>
</Containerr>
  );
};

export default F;
